Revit 2027 API
ElectricalEquipment.CircuitNamingSchemeId Property
 The CircuitNamingSchemeId used in the Electrical Equipment. The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CircuitNamingSchemeId { get; set; }
Public Property CircuitNamingSchemeId As ElementId
	Get
	Set
public:
property ElementId^ CircuitNamingSchemeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CircuitNamingSchemeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The circuit naming scheme id is invalid for the Electrical Equipment.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace